InformationRegisters/ГрафикАдминистративныхМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикАдминистративныхМероприятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПродолжительностьМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПродолжительностьМероприятий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеМероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ВетеринарныеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСДокументамиСервер/Ext/Module.bsl
Процедура ПроверитьОтрицательныеОстаткиРасходников(СписокРасходников, ДатаПолученияОстатков, Отказ) Экспорт
	
	
	
КонецПроцедуры

Процедура ЕстьНаложениеАдминистративныхМероприятий(ДатаВремя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикАдминистративныхМероприятий.Мероприятие КАК Мероприятие,
		|	ГрафикАдминистративныхМероприятий.ДатаНачала КАК ДатаНачала,
		|	ГрафикАдминистративныхМероприятий.ДатаНачала КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ГрафикАдминистративныхМероприятий КАК ГрафикАдминистративныхМероприятий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПродолжительностьМероприятий КАК ПродолжительностьМероприятий
		|		ПО ГрафикАдминистративныхМероприятий.Мероприятие = ПродолжительностьМероприятий.Мероприятие
		|ГДЕ
		|	ГрафикАдминистративныхМероприятий.ДатаНачала = &ДатаНачала";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
Выборка.ДатаНачала + (Выборка.Продолжительность - Дата(1,1,1));
	
КонецПроцедуры
